[{"name":"Nature","url":"https://www.nature.com/nature.rss","articles":[{"title":"Addendum: Unravelling cysteine-deficiency-associated rapid weight loss","link":"https://www.nature.com/articles/s41586-025-09282-7","pubDate":"2025-06-26","description":"No description"},{"title":"Harvard vs Trump: what this epic battle means for science","link":"https://www.nature.com/articles/d41586-025-02017-8","pubDate":"2025-06-26","description":"No description"},{"title":"These scientists re-enacted Stone-Age voyage to Japan’s remotest islands","link":"https://www.nature.com/articles/d41586-025-02008-9","pubDate":"2025-06-25","description":"No description"},{"title":"Can industry fill the gap left by US research funding cuts?","link":"https://www.nature.com/articles/d41586-025-01925-z","pubDate":"2025-06-25","description":"No description"},{"title":"Pioneering but overlooked 1938 fusion experiment is recreated at last","link":"https://www.nature.com/articles/d41586-025-01991-3","pubDate":"2025-06-25","description":"No description"},{"title":"Is AI watching you? The hidden links between research and surveillance","link":"https://www.nature.com/articles/d41586-025-02004-z","pubDate":"2025-06-25","description":"No description"},{"title":"Hormone helps mice live longer and avoid obesity","link":"https://www.nature.com/articles/d41586-025-01896-1","pubDate":"2025-06-25","description":"No description"},{"title":"Is AI powering Big Brother? Surveillance research is on the rise","link":"https://www.nature.com/articles/d41586-025-01936-w","pubDate":"2025-06-25","description":"No description"},{"title":"These are the top companies and countries for industry research","link":"https://www.nature.com/articles/d41586-025-01929-9","pubDate":"2025-06-25","description":"No description"},{"title":"Coherent bunching of anyons and dissociation in an interference experiment","link":"https://www.nature.com/articles/s41586-025-09143-3","pubDate":"2025-06-25","description":"No description"}]},{"name":"BBC Science","url":"http://feeds.bbci.co.uk/news/science_and_environment/rss.xml","articles":[{"title":"Work begins to create artificial human DNA from scratch","link":"https://www.bbc.com/news/articles/c6256wpn97ro","pubDate":"2025-06-26","description":"Scientists start a controversial project to create the building blocks of human life, in what is thought to be a world first."},{"title":"BBC Inside Science","link":"https://www.bbc.co.uk/sounds/play/m002dzyz","pubDate":"2025-06-26","description":"The science behind US attacks on Iran’s nuclear sites."},{"title":"World's oldest boomerang doesn't actually come back","link":"https://www.bbc.com/news/articles/cren818q5x1o","pubDate":"2025-06-25","description":"The 40,000-year-old boomerang was made with an astonishing level of skill and ingenuity, say scientists."},{"title":"India sends its first astronaut into space in 41 years","link":"https://www.bbc.com/news/articles/cz09lx2gjm4o","pubDate":"2025-06-25","description":"Group Captain Shubhanshu Shukla has become only the second Indian to travel to space."},{"title":"River pollution suffocating the sea, campaigners say","link":"https://www.bbc.com/news/articles/cj0m2vp14qno","pubDate":"2025-06-25","description":"New reports are set to show pollution from farming and sewage is affecting protected areas of the sea."},{"title":"More people buying electric cars and heat pumps than ever before","link":"https://www.bbc.com/news/articles/cqjqzj8rnvyo","pubDate":"2025-06-25","description":"But the Climate Change Committee warns there's still a long way to go for the UK to reach net zero by 2050."},{"title":"More people buying electric cars and heat pumps than ever before","link":"https://www.bbc.com/news/articles/cqjqzj8rnvyo","pubDate":"2025-06-25","description":"But the Climate Change Committee warns there's still a long way to go for the UK to reach net zero by 2050."},{"title":"Dog-sized dinosaur that ran around feet of giants discovered","link":"https://www.bbc.com/news/articles/cglzy4zndp0o","pubDate":"2025-06-24","description":"The dinosaur was mislabelled and misunderstood - but scientists now realise how special it is."},{"title":"This burger was made in a lab from cow cells… Should it really be served in restaurants?","link":"https://www.bbc.com/news/articles/cgrxnlpln24o","pubDate":"2025-06-24","description":"Lab-grown beef, chicken and even quail are served in restaurants in some countries around the world - and now some cultivated meats could soon be sold in the UK too"},{"title":"This burger was made in a lab from cow cells… Should it really be served in restaurants?","link":"https://www.bbc.com/news/articles/cgrxnlpln24o","pubDate":"2025-06-24","description":"Lab-grown beef, chicken and even quail are served in restaurants in some countries around the world - and now some cultivated meats could soon be sold in the UK too"}]},{"name":"New Scientist","url":"https://www.newscientist.com/feed/home/","articles":[{"title":"Nearly a third of Tuvaluans have applied for climate migration visa","link":"https://www.newscientist.com/article/2485970-nearly-a-third-of-tuvaluans-have-applied-for-climate-migration-visa/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home","pubDate":"2025-06-26","description":"With their country threatened by sea level rise, the people of Tuvalu have been offered an escape route through an agreement with Australia, and many are contemplating leaving their home"},{"title":"Extreme winter weather isn’t down to a wavier jet stream","link":"https://www.newscientist.com/article/2485835-extreme-winter-weather-isnt-down-to-a-wavier-jet-stream/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home","pubDate":"2025-06-26","description":"The recent erratic behaviour of the polar jet stream isn't out of the ordinary, researchers have found by compiling data from the past 125 years"},{"title":"What sleep scientists recommend doing to fall asleep more easily","link":"https://www.newscientist.com/article/2485876-what-sleep-scientists-recommend-doing-to-fall-asleep-more-easily/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home","pubDate":"2025-06-26","description":"Helping yourself get to sleep isn’t just about avoiding screens before bedtime. From cognitive shuffling to sleep-restriction therapy, columnist Helen Thomson finds out what actually works"},{"title":"Forget the Terminators, our robot future may be squishy and fun","link":"https://www.newscientist.com/article/mg26635490-100-forget-the-terminators-our-robot-future-may-be-squishy-and-fun/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home","pubDate":"2025-06-25","description":"It is uncanny how human fears about robots mirror those about immigrants. But maybe they aren't out to take our jobs or destroy us all, says Annalee Newitz"},{"title":"Spiders that get eaten after sex are picky about mates. You don't say","link":"https://www.newscientist.com/article/mg26635491-800-spiders-that-get-eaten-after-sex-are-picky-about-mates-you-dont-say/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home","pubDate":"2025-06-25","description":"A study into a spider species in which the females are prone to eat the males after sex is welcomed into Feedback's new collection of self-evident scientific studies"},{"title":"Why climate change fades into the background – and how to change that","link":"https://www.newscientist.com/article/mg26635491-600-why-climate-change-fades-into-the-background-and-how-to-change-that/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home","pubDate":"2025-06-25","description":"The public is tuning out the seemingly slow warming of the world, but it doesn't have to be that way, argue Grace Liu and Rachit Dubey"},{"title":"Spellbinding debut book explores the marvels of our brains","link":"https://www.newscientist.com/article/mg26635490-300-spellbinding-debut-book-explores-the-marvels-of-our-brains/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home","pubDate":"2025-06-25","description":"Neurologist Pria Anand recounts curious tales of the workings of the human mind in an elegant debut that is being compared to the late, great Oliver Sacks"},{"title":"Independent estimate of Gaza deaths is higher than official figures","link":"https://www.newscientist.com/article/2485910-independent-estimate-of-gaza-deaths-is-higher-than-official-figures/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home","pubDate":"2025-06-25","description":"A study based on household surveys suggests that from October 2023 to January 2025, around 75,000 people in Gaza died violent deaths, while Gaza's health ministry estimates 46,000 for the same period"},{"title":"Ancient mammoth-tusk boomerang is twice as old as we thought","link":"https://www.newscientist.com/article/2485925-ancient-mammoth-tusk-boomerang-is-twice-as-old-as-we-thought/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home","pubDate":"2025-06-25","description":"A boomerang discovered in a Polish cave was originally dated as 18,000 years old, but it may have been contaminated by preservation materials. A new estimate suggests the mammoth-ivory artefact is 40,..."},{"title":"Gastric bypass surgery may cut the risk of bowel cancer","link":"https://www.newscientist.com/article/2485890-gastric-bypass-surgery-may-cut-the-risk-of-bowel-cancer/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home","pubDate":"2025-06-25","description":"Weight-loss surgery seems to lower the risk of colorectal cancer by changing where bile acids enter the small intestine, raising the possibility of developing treatments that mimic these effects"}]},{"name":"Science Magazine","url":"https://www.science.org/rss/news_current.xml","articles":[{"title":"NIH will reinstate 900 grants in response to court order","link":"https://www.science.org/content/article/nih-will-reinstate-900-grants-response-court-order","pubDate":"2025-06-26","description":"Projects touching on sensitive topics such as DEI had been illegally terminated, judge found"},{"title":"Federal judge orders agencies to restore grants to University of California scientists","link":"https://www.science.org/content/article/federal-judge-orders-agencies-restore-grants-university-california-scientists","pubDate":"2025-06-25","description":"Ruling on first class action suit reversing terminations may be expanded to entire government"},{"title":"In latest blow, National Science Foundation staff to be booted from their headquarters","link":"https://www.science.org/content/article/latest-blow-national-science-foundation-staff-be-booted-their-headquarters","pubDate":"2025-06-25","description":"Trump administration is giving building to housing department but has not said where science agency will go"},{"title":"Global warming is triggering earthquakes in the Alps","link":"https://www.science.org/content/article/global-warming-triggering-earthquakes-alps","pubDate":"2025-06-25","description":"Study provides first solid link between climate change and earthquake hazard"},{"title":"A mammoth boomerang returns new clues about early human toolmaking","link":"https://www.science.org/content/article/mammoth-boomerang-returns-new-clues-about-early-human-toolmaking","pubDate":"2025-06-25","description":"New dates for a throwing weapon found in Poland reveal it as one of the earliest of its kind"},{"title":"Prestigious NSF graduate fellowship tilts toward AI and quantum","link":"https://www.science.org/content/article/prestigious-nsf-graduate-fellowship-tilts-toward-ai-and-quantum","pubDate":"2025-06-25","description":"Students in the life sciences are shut out of latest cohort of 500 fellows"},{"title":"National rare disease effort among those upended by Trump’s freeze on Harvard grants","link":"https://www.science.org/content/article/national-rare-disease-effort-among-those-upended-trump-s-freeze-harvard-grants","pubDate":"2025-06-25","description":"White House battle with Ivy League school disrupts databases and networks relied on by other universities"},{"title":"Following court order, NIH ceases new terminations of politically sensitive grants","link":"https://www.science.org/content/article/following-court-order-nih-ceases-new-terminations-politically-sensitive-grants","pubDate":"2025-06-25","description":"After a judge told agency to restore hundreds of killed grants, NIH backs off plans to cancel more existing projects"},{"title":"Tumors may get supercharged by acquiring powerhouses of nerve cells","link":"https://www.science.org/content/article/tumors-may-get-supercharged-acquiring-powerhouses-nerve-cells","pubDate":"2025-06-25","description":"Scientists spot mitochondria traveling through “bridges” into nearby cancer cells"},{"title":"Space telescope spies smallest alien world to be seen directly","link":"https://www.science.org/content/article/space-telescope-spies-smallest-alien-world-be-seen-directly","pubDate":"2025-06-25","description":"NASA’s JWST observatory takes picture of young, Saturn-size world that grew by sweeping up debris"}]},{"name":"arXiv Computer Science","url":"https://export.arxiv.org/rss/cs","articles":[{"title":"Secure Energy Transactions Using Blockchain Leveraging AI for Fraud Detection and Energy Market Stability","link":"https://arxiv.org/abs/2506.19870","pubDate":"2025-06-26","description":"arXiv:2506.19870v1 Announce Type: new \nAbstract: Peer-to-peer trading and the move to decentralized grids have reshaped the energy markets in the United States. Notwithstanding, such developments lead..."},{"title":"An Attack Method for Medical Insurance Claim Fraud Detection based on Generative Adversarial Network","link":"https://arxiv.org/abs/2506.19871","pubDate":"2025-06-26","description":"arXiv:2506.19871v1 Announce Type: new \nAbstract: Insurance fraud detection represents a pivotal advancement in modern insurance service, providing intelligent and digitalized monitoring to enhance man..."},{"title":"Towards Provable (In)Secure Model Weight Release Schemes","link":"https://arxiv.org/abs/2506.19874","pubDate":"2025-06-26","description":"arXiv:2506.19874v1 Announce Type: new \nAbstract: Recent secure weight release schemes claim to enable open-source model distribution while protecting model ownership and preventing misuse. However, th..."},{"title":"Robust Anomaly Detection in Network Traffic: Evaluating Machine Learning Models on CICIDS2017","link":"https://arxiv.org/abs/2506.19877","pubDate":"2025-06-26","description":"arXiv:2506.19877v1 Announce Type: new \nAbstract: Identifying suitable machine learning paradigms for intrusion detection remains critical for building effective and generalizable security solutions. I..."},{"title":"Blameless Users in a Clean Room: Defining Copyright Protection for Generative Models","link":"https://arxiv.org/abs/2506.19881","pubDate":"2025-06-26","description":"arXiv:2506.19881v1 Announce Type: new \nAbstract: Are there any conditions under which a generative model's outputs are guaranteed not to infringe the copyrights of its training data? This is the quest..."},{"title":"Position: Machine Learning Conferences Should Establish a \"Refutations and Critiques\" Track","link":"https://arxiv.org/abs/2506.19882","pubDate":"2025-06-26","description":"arXiv:2506.19882v1 Announce Type: new \nAbstract: Science progresses by iteratively advancing and correcting humanity's understanding of the world. In machine learning (ML) research, rapid advancements..."},{"title":"STIMULUS: Achieving Fast Convergence and Low Sample Complexity in Stochastic Multi-Objective Learning","link":"https://arxiv.org/abs/2506.19883","pubDate":"2025-06-26","description":"arXiv:2506.19883v1 Announce Type: new \nAbstract: Recently, multi-objective optimization (MOO) has gained attention for its broad applications in ML, operations research, and engineering. However, MOO ..."},{"title":"MNN-AECS: Energy Optimization for LLM Decoding on Mobile Devices via Adaptive Core Selection","link":"https://arxiv.org/abs/2506.19884","pubDate":"2025-06-26","description":"arXiv:2506.19884v1 Announce Type: new \nAbstract: As the demand for on-device Large Language Model (LLM) inference grows, energy efficiency has become a major concern, especially for battery-limited mo..."},{"title":"FlightKooba: A Fast Interpretable FTP Model","link":"https://arxiv.org/abs/2506.19885","pubDate":"2025-06-26","description":"arXiv:2506.19885v1 Announce Type: new \nAbstract: The Koopman theory is a powerful and effective modeling tool for converting nonlinear systems into linear representations, and flight trajectory predic..."},{"title":"Diffusion-based Task-oriented Semantic Communications with Model Inversion Attack","link":"https://arxiv.org/abs/2506.19886","pubDate":"2025-06-26","description":"arXiv:2506.19886v1 Announce Type: new \nAbstract: Semantic communication has emerged as a promising neural network-based system design for 6G networks. Task-oriented semantic communication is a novel p..."}]},{"name":"PLoS ONE","url":"https://journals.plos.org/plosone/feed/atom","articles":[{"title":"Astragaloside IV combined with quercetin attenuates silica-induced pulmonary fibrosis by promoting autophagy and suppressing pyroptosis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327255","pubDate":"2025-06-25","description":"by Wenwen Zhu, Ningxia Zhao, Yinghua Ma, Wei Zhang, Jiazi Ma, Mao Cao, Yong Yang, Shichao Sun, Zhifeng Pan, Hua Shao, Zhongjun Du\r\nBackground Silicosis, a prevalent occupational disease caused by expo..."},{"title":"Understanding the audiological care of patients with co-existing dementia or mild cognitive impairment and hearing loss in the United Kingdom National Health Service: A qualitative study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327248","pubDate":"2025-06-25","description":"by Sian Calvert, Aaron Chitty, Alex Langdon, Emma Broome, Helen Henshaw, Sarah Somerset, Tom Dening, Eithne Heffernan\r\nBackground Hearing loss is common among people living with dementia and can exace..."},{"title":"Predictive validity of early and mid-year literacy assessments for end-of-year word reading fluency","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327242","pubDate":"2025-06-25","description":"by Saeed Saad Alqahtani\r\n\r\nThis study explores the predictive validity of early and mid-year literacy assessments—Letter Naming Fluency (LNF), Letter Sound Fluency (LSF), and Phoneme Segmentation Flue..."},{"title":"Differential interactions of ToLCNDV with different betasatellites reveal complex viral dynamics in <i>N. benthamiana</i>","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327234","pubDate":"2025-06-25","description":"by Zafar Iqbal, Muhammad Shafiq, Sajed Ali, Mudassar Fareed Awan, Muhammad Farhan Sarwar, Imran Amin, Muhammad Shafiq Shahid, Rob W. Briddon\r\n\r\nTomato leaf curl New Delhi virus (ToLCNDV), a bipartite ..."},{"title":"Clinical characteristics and outcomes of intraocular lens dislocation: an eight-year retrospective study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327210","pubDate":"2025-06-25","description":"by Su Xu, Jingzhi Shao, Yuhang Zhang, Wei Si, Yi Mao, Shanshan Du, Fengyan Zhang\r\nObjective To investigate the clinical characteristics, risk factors, and short-term visual outcomes following surgical..."},{"title":"A mixed-methods evaluation of a Polish international researcher mobility grant scheme","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327196","pubDate":"2025-06-25","description":"by Adam Ploszaj\r\n\r\nThis paper examines the quantitative and qualitative effects of the first call of the Bekker Programme, funded by the Polish National Agency for Academic Exchange. The program suppo..."},{"title":"Inadequate lumbar protection with load weight limits based on body weight percentages: An experimental and simulation study of the weight limits set by the Japanese guidelines for preventing low back pain","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327175","pubDate":"2025-06-25","description":"by Fuyuki Oyama, Tanghuizi Du, Kazuyuki Iwakiri\r\n\r\nWork-related low back pain is the most prevalent occupational disease in Japan, with 25% of cases resulting from manual handling of heavy loads. The ..."},{"title":"fMRI insights into differential brain activation, executive function, and physical activity in older adults","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327163","pubDate":"2025-06-25","description":"by Huiqi Song, Jie Feng, Yingying Wang, Qichen Zhou, Chenglin Zhou, Jing Jin\r\nBackground Executive function is vital for cognitive health, particularly in older adults, where declines can lead to an i..."},{"title":"Impact of monitor unit optimization in volumetric modulated arc therapy planning for nasopharyngeal carcinoma","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327153","pubDate":"2025-06-25","description":"by Huaqu Zeng, Zhen Li, Zongyou Chen, Shukui Tang, Qifu Lin, Minzhi Zhong, Zunbei Wen\r\nPurpose To evaluate the impact of monitor units (MUs) optimization on volumetric modulated arc therapy (VMAT) pla..."},{"title":"Integrative analysis of the metabolome and transcriptome provides insights into the mechanisms of amino acids and their derivatives biosynthesis in <i>Polygonatum</i>","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327145","pubDate":"2025-06-25","description":"by Xiuzhi Wang, Lingjun Cui, Qiang Xiao\r\n\r\nThe composition and concentration of amino acids and their derivatives in Polygonatum are crucial factors that indicate its nutritional value and have a subs..."}]}]